{
  "</s>": 32003,
  "<</SYS>>": 32007,
  "<<SYS>>": 32006,
  "<|assistant|>": 32010,
  "<|begin_of_text|>": 32011,
  "<|end_header_id|>": 32013,
  "<|end_of_turn|>": 32000,
  "<|eot_id|>": 32014,
  "<|im_start|>": 32002,
  "<|pad|>": 32001,
  "<|reserved_0|>": 32015,
  "<|reserved_10|>": 32025,
  "<|reserved_11|>": 32026,
  "<|reserved_12|>": 32027,
  "<|reserved_13|>": 32028,
  "<|reserved_14|>": 32029,
  "<|reserved_15|>": 32030,
  "<|reserved_16|>": 32031,
  "<|reserved_17|>": 32032,
  "<|reserved_18|>": 32033,
  "<|reserved_19|>": 32034,
  "<|reserved_1|>": 32016,
  "<|reserved_20|>": 32035,
  "<|reserved_21|>": 32036,
  "<|reserved_22|>": 32037,
  "<|reserved_23|>": 32038,
  "<|reserved_24|>": 32039,
  "<|reserved_25|>": 32040,
  "<|reserved_26|>": 32041,
  "<|reserved_27|>": 32042,
  "<|reserved_28|>": 32043,
  "<|reserved_29|>": 32044,
  "<|reserved_2|>": 32017,
  "<|reserved_30|>": 32045,
  "<|reserved_31|>": 32046,
  "<|reserved_32|>": 32047,
  "<|reserved_33|>": 32048,
  "<|reserved_34|>": 32049,
  "<|reserved_35|>": 32050,
  "<|reserved_36|>": 32051,
  "<|reserved_37|>": 32052,
  "<|reserved_38|>": 32053,
  "<|reserved_39|>": 32054,
  "<|reserved_3|>": 32018,
  "<|reserved_40|>": 32055,
  "<|reserved_41|>": 32056,
  "<|reserved_42|>": 32057,
  "<|reserved_43|>": 32058,
  "<|reserved_44|>": 32059,
  "<|reserved_45|>": 32060,
  "<|reserved_46|>": 32061,
  "<|reserved_47|>": 32062,
  "<|reserved_48|>": 32063,
  "<|reserved_4|>": 32019,
  "<|reserved_5|>": 32020,
  "<|reserved_6|>": 32021,
  "<|reserved_7|>": 32022,
  "<|reserved_8|>": 32023,
  "<|reserved_9|>": 32024,
  "<|start_header_id|>": 32012,
  "<|system|>": 32009,
  "<|user|>": 32008,
  "[/INST]": 32005,
  "[INST]": 32004
}
